{
    "1-2": [
        {
            "name": "Primes",
            "stars": 1,
            "prereqs": "None!",
            "useful": "",
            "blurb": "Number theory is a very important mathematical field, in which many problems remain unsolved. One of the most important concepts in number theory is the notion of prime numbers. We will go over the definition of a prime number, as well as some properties of the numbers and techniques in which they are key."
        },
        {
            "name": "Numeric Bases",
            "stars": 2,
            "prereqs": "Basic Algebra",
            "useful": "Exponents",
            "blurb": "Do you ever write numbers? Then, do you ever wish you could write the number 24 as 10? Many people think that ever! In this lesson, we decompose our decimal number system, find out how it works, and modify it to discover the language of computers. "
        },
        {
            "name": "Logic and Proofs",
            "stars": 5,
            "prereqs": "Pythagorean Theorem, Primes",
            "useful": "Basic Geometry",
            "blurb": "In school, mathematics is memorizing formulas. However, the field of mathematics is really based in proofs. Nothing is true unless we can prove it to be true, and herein lies the true meaning of mathematics. The jump from computation to proofs may prove difficult to some students, and so this short lecture hopes to cushion this transition with an introduction to logic and a preview of some of the most well-known proofs in mathematics."
        }
    ],
    "2-1": [
        {
            "name": "Basic Triangle Geometry",
            "stars": 2,
            "prereqs": "None!",
            "useful": "",
            "blurb": "Triangles make up a large part of the foundations of geometry. They are seen in almost all geometry problems, even up to olympiad levels. Despite being such a seemingly simple shape, the properties and theorems relating to triangles span infinitely. This lesson serves as a brief introduction to the basic definitions and properties of triangles, but also dips into more interesting topics such as the Pythagorean theorem and congruency/similarity between triangles. Suitable for students with little to no prior geometry experience."
        },
        {
            "name": "Basic Trigonometry",
            "stars": 3,
            "prereqs": "Basic Algebra, Basic Geometry",
            "useful": "Coordinates in the Cartesian Plane, Pythagorean Theorem, Familiarity with calculators",
            "blurb": "Triangles are defined as a shape with three sides. Despite their simplicity, they host numerous unique properties that are unrivaled by any other shape, creating a whole field dedicated to the study of triangles called trigonometry. Here, we will focus on the three main functions of \\cos, \\sin, and \\tan, see how they are defined, and how they are used. "
        },
        {
            "name": "3D Geometry",
            "stars": 4,
            "prereqs": "Areas of 2D Figures, 2D Coordinate Plane",
            "useful": "",
            "blurb": "3D geometry is a fascinating area of geometry similar to 2D geometry, but with another axis of movement introduced, adding a new layer of complexity and interesting concepts to be explored. In this lesson, we will be covering the volumes and surface areas of common 3D figures, followed by an overview of the 3D coordinate plane, and then onto the more niche topic of shortest paths on 3D surfaces. This lesson is suitable for students with a strong understanding of 2D geometry."
        }
    ],
    "2-2": [
        {
            "name": "Basic Statistics",
            "stars": 1,
            "prereqs": "None!",
            "useful": "",
            "blurb": "How many middle school students have taken a statistics course before? That’s a statistical question! Statistics is the study of the collection and analysis of numerical data. Statistics is a key component of computer science, engineering, and education. In this session, we also cover graphs which are very effective in presenting organized information. We end by discussing how misleading graphs are used to intentionally manipulate readers."
        },
        {
            "name": "Modular Arithmetic",
            "stars": 3,
            "prereqs": "Basic Number Theory",
            "useful": "Basic Algebra",
            "blurb": "Modular arithmetic is the key to more advanced levels of number theory. In class, we will start by teaching definition of modular arithmetic,  followed by showing how to do basic operations with them. Then, we will show some formulas related to modular arithmetic. Finally, we will have a problem session of the topics we covered. Recommend for students who have a grasp of basic number theory."
        },
        {
            "name": "Infinite Series",
            "stars": 5,
            "prereqs": "Strong Grasp in Algebra",
            "useful": "",
            "blurb": "A series is a sum of a sequence of numbers. An infinite} series is a sum of an \\emph{infinite sequence of numbers. In this lecture, we will explore what infinite means in the context of sequences and series. Infinite series turn out to be both elegant and surprising, with plenty of practical applications and theoretical results."
        }
    ],
    "3-1": [
        {
            "name": "Intro to Counting and Probabilty",
            "stars": 2,
            "prereqs": "None!",
            "useful": "Fractions, Factorial, Multiples, Arithmetic Sequences",
            "blurb": "Counting deals with how we arrange objects as well as counting the number of ways to make decisions, and probability deals with how likely events are to occur, both of which are surprisingly applicable in the real world. However, we will explore their appeal in pure mathematics and the joy of combinatorics!"
        },
        {
            "name": "Game Theory",
            "stars": 3,
            "prereqs": "None",
            "useful": "",
            "blurb": "Game theory is the study of optimal decision, especially when there are multiple decision-makers involved. These decision problems happen all the time, from games like chess to entire fields like economics. In this field of applied mathematics, we'll use math and logic to briefly introduce the study of ``classical'' and ``combinatorial'' games."
        },
        {
            "name": "Intro to Graph Theory",
            "stars": 4,
            "prereqs": "Simple Combinatorics",
            "useful": "3D Geometry",
            "blurb": "Graphs are everywhere in real life, from social networks to advanced statistical modeling. In this class, we will be learning the basic terminology for graphs and then exploring some of the most interesting applications of graph theory to the real world."
        }
    ],
    "3-2": [
        {
            "name": "Mental Math",
            "stars": 2,
            "prereqs": "None!",
            "useful": "Place Values",
            "blurb": "Being able to do math mentally is having the ability to do mental math. This is useful! Mental math is also useful. It will be useful for many things. For example, consider the thing that is squaring four digit numbers in your head. That is one of the things. Congratulations."
        },
        {
            "name": "Solving Equations",
            "stars": 3,
            "prereqs": "Arithmetic",
            "useful": "Square Roots, Solving Linear Equations",
            "blurb": "Solving an equation is part of almost every math problem. In this lesson, we cover the general techniques you'll need to solve these equations, building up from the very basics. We'll start with simple substitutions and work our way up to more complicated manipulations."
        },
        {
            "name": "Circle Geometry",
            "stars": 4,
            "prereqs": "Basic Triangle Geometry",
            "useful": "",
            "blurb": "The deeper you go into the vast subject of geometry, the more prevalent circles seem to become. This lesson will serve as an introduction to geometry involving circles. We will begin with some basic definitions and properties of circles, as well as introduce \\pi. We will then move onto more complicated topics, such as tangency and the inscribed angle theorem. The lesson contains many circle geometry problems, some from previous AMCs. This lesson is suitable for students already familiar with basic triangle geometry."
        }
    ],
    "4-1": [
        {
            "name": "Elementary Algebra",
            "stars": 1,
            "prereqs": "Primary school math",
            "useful": "",
            "blurb": "Numbers, variables, and equations are all studied in algebra, which is the sine qua non of competition math. This session is not very difficult, and we only briefly cover a few topics of algebra such as expressions, absolute value, and word problem tips."
        },
        {
            "name": "2D Graphing",
            "stars": 2,
            "prereqs": "None!",
            "useful": "",
            "blurb": "2D Graphing is a fundamental part of middle school and high school mathematics. It allows students to understand how to visualize functions and shapes, which is helpful in finding interesting patterns in numbers and building models. These techniques are useful in calculus and analysis, which extend into the realm of higher mathematics."
        },
        {
            "name": "Complex Numbers",
            "stars": 4,
            "prereqs": "Quadratic Formula, Pythagorean Theorem",
            "useful": "Basic Trigonometry",
            "blurb": "Complex numbers are an interesting extension of the usual number system, where i^2 = -1. In a sense, i is not real, but complex numbers still are an important aspect of mathematics. We will cover basic operations with complex numbers, as well as their geometric interpretations. We will then build up to one of the most beautiful images in all of mathematics, the Mandelbrot Set. Suitable for advanced students with a strong grasp of algebra and geometry."
        }
    ],
    "4-2": [
        {
            "name": "Paper Crafts",
            "stars": 1,
            "prereqs": "Hands",
            "useful": "",
            "blurb": "In this class, we take a break from doing math with pen on paper by entirely removing the pens. No pens (or pencils) will be used at any point in the lesson. We will introduce cool structures that can be made of paper like mobius strips and hexaflexagons. We will also take a close examination of paper's worst enemy (scissors, obviously) and its dangerous capabilities."
        },
        {
            "name": "Expected Value",
            "stars": 3,
            "prereqs": "Some understanding of Counting and Probability",
            "useful": "",
            "blurb": "Complex numbers are an interesting extension of the usual number system, where i^2 = -1. In a sense, i is not real, but complex numbers still are an important aspect of mathematics. We will cover basic operations with complex numbers, as well as their geometric interpretations. We will then build up to one of the most beautiful images in all of mathematics, the Mandelbrot Set. Suitable for advanced students with a strong grasp of algebra and geometry."
        },
        {
            "name": "Pascal's Triangle",
            "stars": 4,
            "prereqs": "Basic Combinatorics, Basic Algebra",
            "useful": "Proofs and Notation",
            "blurb": "Pascal's triangle is a fundamental part of combinatorics, and can help to prove identities as well as to investigate relationships between the binomial coefficients. We will explore the triangle and its relationships through various different activities."
        }
    ],
    "5-1": [
        {
            "name": "Intro to Sequences",
            "stars": 2,
            "prereqs": "Quadratic Formula, Solving Systems of Equations",
            "useful": "Mediocre Algebra, Simple Combinatorics",
            "blurb": "A \\textbf{sequence} is just a set of things in a special order. These things can be whatever you want them to be -- numbers, shapes, bananas, whatever. We'll only explore sequences that have to deal with numbers. These numerical sequences come up in a variety of different problems, and we'll learn to handle some of the more common sequences (as well as some uncommon ones)."
        },
        {
            "name": "Competition Strategies",
            "stars": 2,
            "prereqs": "Basic Algebra, Geometry and Combinatorics",
            "useful": "Prior Experience with Competitions",
            "blurb": "A lot of middle and high school math is dominated by the AMC competition series and other competitions like MATHCOUNTS or Harvard-MIT Math Tournament. In this class, students will be introduced to a variety of resources and strategies."
        },
        {
            "name": "Recursion",
            "stars": 5,
            "prereqs": "Elementary Algebra and a strong foundation in Counting and Probability",
            "useful": "Understanding of the concept of $\\infty$",
            "blurb": "In this class students will learn how to solve larger problems by considering smaller subproblems. The concept of recursion can be used in various fields including math and computer science. A famous example of a recursion is the Fibonacci sequence, which is defined as F_n = F_{n-1} + F_{n-2}. We can work with this smaller definition to classify Fibonacci numbers more explicitly; we will cover methods of simplification in the class."
        }
    ],
    "5-2": [
        {
            "name": "Logic Puzzles",
            "stars": 2,
            "prereqs": "None",
            "useful": "",
            "blurb": "Logic puzzles are fun problems that you need logic to solve (big surprise there!). There are varying levels of difficulty for logic puzzles, and several different types of problems will be introduced here."
        },
        {
            "name": "Grid Puzzles",
            "stars": 3,
            "prereqs": "None!",
            "useful": "Basic understanding of Sudoku or chess",
            "blurb": "Grid Puzzles are very interesting types of logic problems. They involve logical reasoning and incorporate visuals as either a part of the problem or as a helpful tool to solve problems. "
        },
        {
            "name": "Decisions and Paradoxes",
            "stars": 4,
            "prereqs": "Probability",
            "useful": "Circles, Sequences",
            "blurb": "This sentence is false. But, we all know that isn't true. Paradoxes force us to question, and we find shakiness in the foundations everything is built upon before reinforcing them rigorously. We end more knowledgeable with a new lesson learned. In this class we will be exploring both mathematical and philosophical paradoxes, from common ones like the Monty Hall Problem to others like the Ship of Theseus."
        }
    ]
}